#列表中的":","::"是什么意思，python中用这两个符号来代表列表中的切片操作
#":"表明有两个参数，如a:b，意味从索引a开始取，直到索引b为止，但不包括索引b
#"::"表明有三个参数，如a:b:c，意味着从索引a开始取，中间间隔为c，直到索引b为止，但不包括索引b。

list1 = [1, 2, 3, 4, 5, 6, 7 ]

print(list1[0:])
#输出[1, 2, 3, 4, 5, 6, 7]

print(list1[:0])
#输出[]

print(list1[:])
#输出[1, 2, 3, 4, 5, 6, 7]

print(list1[:-1])
#输出[1, 2, 3, 4, 5, 6]

print(list1[-1:])
#输出[7]

print(list1[0:3])
#输出[1, 2, 3]

list2 = [1, 2, 3, 4, 5, 6, 7 ]

print(list2[::])
#输出[1, 2, 3, 4, 5, 6, 7]

print(list2[0::])
#输出[1, 2, 3, 4, 5, 6, 7]

print(list2[:0:])
#输出[]

print(list2[:0:1])
#输出[]

print(list2[::0])
#输出ValueError:slice step cannot be zero

print(list2[0:5:1])
#输出[1, 2, 3, 4, 5]

print(list2[::-1])
#输出[7, 6, 5, 4, 3, 2, 1]
